Revit 2026 API

# AnalysisDisplayColoredSurfaceSettings Properties

---

The AnalysisDisplayColoredSurfaceSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GridColor | Color of grid lines. |
|  | GridLineWeight | Line weight of grid lines. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowContourLines | If true, show contour lines in the analysis display. |
|  | ShowGridLines | If true, show grid lines in the analysis display. |
|  | Transparency | Transparency percentage of colored surface |

#### Reference

AnalysisDisplayColoredSurfaceSettings Class

Autodesk.Revit.DB.Analysis Namespace